{"config": {"name": "model_4", "output_layers": [["dense_6", 0, 0]], "layers": [{"name": "input_6", "config": {"sparse": false, "name": "input_6", "batch_input_shape": [null, 8], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_5", "config": {"sparse": false, "name": "input_5", "batch_input_shape": [null, 4096], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_2", "config": {"embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "dtype": "float32", "mask_zero": true, "embeddings_constraint": null, "input_dim": 3033, "output_dim": 256, "input_length": null, "activity_regularizer": null, "embeddings_regularizer": null, "trainable": true, "name": "embedding_2"}, "class_name": "Embedding", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "dense_4", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 256, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "dense_4"}, "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "lstm_2", "config": {"recurrent_dropout": 0.0, "recurrent_regularizer": null, "unroll": false, "return_sequences": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "lstm_2", "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_constraint": null, "dropout": 0.0, "activation": "tanh", "stateful": false, "implementation": 1, "return_state": false, "units": 256, "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_constraint": null}, "class_name": "LSTM", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "add_2", "config": {"name": "add_2", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["dense_4", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"name": "dense_5", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 256, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "dense_5"}, "class_name": "Dense", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "dense_6", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 3033, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "dense_6"}, "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}, "keras_version": "2.2.0", "class_name": "Model", "backend": "tensorflow"}